def getMainMenuButtons():
    return {
        "createNewPage" : "Создание страницы",
        "Categories" : "Категории",
        "News" : "Новости",
        "Settings" : "Настройки",
        "Logs" : "Логи",
        "RegisterUser" : "Ввести код-приглашение",
        "CancelAction" : "❌ Отмена",
    }

def getSettingsMenuButtons():
    return {
        "cache" : "Кэш",
        "checkFiles" : "Просмотр файлов",
        "changeSiteInformation" : "Изменение информации о сайте",
        "manage" : "Управление",
        "admins" : "Админы",
        "version" : "Версия",
        "back" : "Назад на главную",
    }

def getMessages():
    return {
        "welcomeRegister" : "Добрый день, {0}!\n🟢 Вы авторизованы",
        "welcomeUnRegister" : "Добрый день, {0}!\n🟥 Вы не авторизованы!",
        "unregisterAnswer" : "Вы не авторизованы.",
        "cancelAction" : "Отмена операции",
        "createPage_start" : "Для создания новой страницы необходимо ввести следующую информацию:\n1. Название\n2. Категорию\n3. Скрыть ли страницу",
        "createPage_enterName" : "Введите название новой страницы",
        "createPage_enterCategory" : "Выберите категорию",
        "createPage_isHide" : "Скрыть страницу?",
        "createPage_Confim" : "Проверьте правильность информации:\n\nНазвание: {0}\nКатегория: {1}\nСкрыть: {2}\n\nСохранить?",
        "createPage_cancel" : "Отмена создания страницы",
        "createPage_Ok" : "Создание страницы",
        "settingsText" : "Настройки",
    }